app/controllers/personal_expenses_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def index
    @user = User.find(params[:user_id])

INSERT INTO "personal_expenses" ("name", "amount", "category_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "some more stuuf"], ["amount", 345], ["category_id", 12], ["user_id", 1], ["created_at", "2019-01-23 17:16:44.155864"], ["updated_at", "2019-01-23 17:16:44.155864"]]
---
  def create
    byebug
    @personal_expense = PersonalExpense.create(persona_exp_params)

UPDATE "personal_expenses" SET "category_id" = ?, "updated_at" = ? WHERE "personal_expenses"."id" = ?  [["category_id", 13], ["updated_at", "2019-01-23 17:54:28.888349"], ["id", 1]]
---
  def update
    # @personal_expense = PersonalExpense.find(params[:id])
    byebug
    @personal_expense.update(persona_exp_params)

DELETE FROM "personal_expenses" WHERE "personal_expenses"."id" = ?  [["id", 176]]
---
  def destroy
    user = @personal_expense.user

    @personal_expense.destroy

SELECT  "personal_expenses".* FROM "personal_expenses" WHERE "personal_expenses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_personal_exp
    @personal_expense = PersonalExpense.find(params[:id])