app/controllers/personal_expenses_controller.rb

SELECT  "personal_expenses".* FROM "personal_expenses" WHERE "personal_expenses"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def edit
    @personal_expense = PersonalExpense.find(params[:id])

SELECT  "personal_expenses".* FROM "personal_expenses" WHERE "personal_expenses"."id" = ? LIMIT ?  [["id", 193], ["LIMIT", 1]]
---
  def update
    @personal_expense = PersonalExpense.find(params[:id])

SELECT  "personal_expenses".* FROM "personal_expenses" WHERE "personal_expenses"."id" = ? LIMIT ?  [["id", 190], ["LIMIT", 1]]
---
  def find_personal_exp
    @personal_expense = PersonalExpense.find(params[:id])