app/controllers/shared_wallets_controller.rb

SELECT  "shared_wallets".* FROM "shared_wallets" WHERE "shared_wallets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_shared_wallet
    @shared_wallet = SharedWallet.find(params[:id])