app/controllers/shared_wallets_controller.rb

  def find_user
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def find_shared_wallet
    @shared_wallet = PersonalExpense.find(params[:id])
---
SELECT  "personal_expenses".* FROM "personal_expenses" WHERE "personal_expenses"."id" = ? LIMIT ?  [["id", 185], ["LIMIT", 1]]