app/views/personal_expenses/_form.html.erb

         <datalist id="category">
               <% Category.all.each do |c| %>
---
SELECT "categories".* FROM "categories"